# Core tools (cross-platform)
brew "pure"
brew "stow"
brew "rbenv"
brew "nodenv"
brew "readline"
brew "vim"
brew "git"
brew "zsh"
brew "tmux"
brew "fzf"
brew "gh"
brew "ripgrep"
brew "adr-tools"
brew "git-delta"
brew "direnv"
# brew "octo-cli/octo/octo"
brew "exiftool"
brew "imagemagick"
brew "ctags"
brew "neovim"

# github sql primer
brew "git-lfs"

# for setting up emails from google locally
brew "neomutt"
brew "urlview"
brew "notmuch"
brew "offlineimap"
brew "msmtp"

# macOS only (no Linux bottles available)
if OS.mac?
  # Required for tmux copy/paste on macOS
  brew "reattach-to-user-namespace"
  # https://github.com/zerowidth/zoom-calendar.alfredworkflow
  brew "ical-buddy"
end
