brew "stow" 
brew "rbenv"
brew "nodenv"
brew "readline"
brew "vim"
brew "git"
brew "tmux"
brew "reattach-to-user-namespace"
brew "fzf"
brew "github/gh/gh"
brew "ripgrep"
brew "adr-tools"
brew "git-delta"
brew "direnv"
brew "octo-cli/octo/octo"

# https://github.com/zerowidth/zoom-calendar.alfredworkflow
brew "ical-buddy"

# github sql primer
brew "git-lfs"

# for setting up emails from google locally
brew "neomutt"
brew "urlview"
brew "notmuch"
brew "offlineimap"
brew "msmtp"
